InformationRegisters/ОтпускныеЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ОтпускныеЦены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗакупочныеЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ЗакупочныеЦены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНаУслуги</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСоСправочниками/Ext/Module.bsl
Функция ОтпускнаяЦена(АктуальнаяДата, ЭлементТовары) Экспорт  
	
	// Создать вспомогательный объект "Отбор".
	Отбор = Новый Структура("Товар", ЭлементТовары);  
	
	// Получить актуальные значения ресурсов регистра.
	ЗначенияРесурсов = РегистрыСведений.ОтпускныеЦены.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначенияРесурсов.Цена;
	
КонецФункции    

Функция ЗакупочнаяЦена(АктуальнаяДата, ЭлементТовары) Экспорт  
	
	// Создать вспомогательный объект "Отбор".
	Отбор = Новый Структура("Товар", ЭлементТовары);  
	
	// Получить актуальные значения ресурсов регистра.
	ЗначенияРесурсов = РегистрыСведений.ЗакупочныеЦены.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначенияРесурсов.Цена;
	
КонецФункции   

Функция ЦенаУслуги(АктуальнаяДата, ЭлементУслуги) Экспорт  
	
	// Создать вспомогательный объект "Отбор".
	Отбор = Новый Структура("Услуга", ЭлементУслуги);  
	
	// Получить актуальные значения ресурсов регистра.
	ЗначенияРесурсов = РегистрыСведений.ЦеныНаУслуги.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначенияРесурсов.Цена;
	
КонецФункции
